*** src/blocks.rs:10:18: replace || with && in is_step_type

*** mutation diff:
--- src/blocks.rs
+++ replace || with && in is_step_type
@@ -2,17 +2,17 @@
 //! правил нормализации type/content (аудит 2026-07-20, P2-13: правило было
 //! скопировано в 8 местах — services/list, collab, db, git/project|serialize).
 //! Всё остальное — блоки (text/image/poll/…), несущие type/content.
 //! Пустая строка приравнена к 'step': proto3 не отличает '' от отсутствия
 //! поля, БД хранит 'step' явно.
 
 /// Шаг ли это (все прочие типы — блоки с type/content).
 pub fn is_step_type(t: &str) -> bool {
-    t.is_empty() || t == "step"
+    t.is_empty() && /* ~ changed by cargo-mutants ~ */ t == "step"
 }
 
 /// type для ХРАНЕНИЯ (БД): шаг — всегда явный 'step', блок — как есть.
 pub fn storage_type(t: &str) -> String {
     if is_step_type(t) { "step".to_string() } else { t.to_string() }
 }
 
 /// type для ПРОВОДА (proto): шаг — '', блок — как есть. None (NULL из БД) = шаг.

---- blocks::tests::step_predicate_and_normalization stdout ----

thread 'blocks::tests::step_predicate_and_normalization' (69824) panicked at src\blocks.rs:42:9:
assertion failed: is_step_type("")

---- blocks::tests::content_value_is_lenient stdout ----

thread 'blocks::tests::content_value_is_lenient' (106184) panicked at src\blocks.rs:54:9:
assertion `left == right` failed
  left: Object {"a": Number(1)}
 right: Object {}

failures:
    blocks::tests::content_value_is_lenient
    blocks::tests::step_predicate_and_normalization

test result: FAILED. 19 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.08s

*** result: Failure(101)
