*** src/blocks.rs:10:5: replace is_step_type -> bool with true

*** mutation diff:
--- src/blocks.rs
+++ replace is_step_type -> bool with true
@@ -2,17 +2,17 @@
 //! правил нормализации type/content (аудит 2026-07-20, P2-13: правило было
 //! скопировано в 8 местах — services/list, collab, db, git/project|serialize).
 //! Всё остальное — блоки (text/image/poll/…), несущие type/content.
 //! Пустая строка приравнена к 'step': proto3 не отличает '' от отсутствия
 //! поля, БД хранит 'step' явно.
 
 /// Шаг ли это (все прочие типы — блоки с type/content).
 pub fn is_step_type(t: &str) -> bool {
-    t.is_empty() || t == "step"
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// type для ХРАНЕНИЯ (БД): шаг — всегда явный 'step', блок — как есть.
 pub fn storage_type(t: &str) -> String {
     if is_step_type(t) { "step".to_string() } else { t.to_string() }
 }
 
 /// type для ПРОВОДА (proto): шаг — '', блок — как есть. None (NULL из БД) = шаг.

---- blocks::tests::step_predicate_and_normalization stdout ----

thread 'blocks::tests::step_predicate_and_normalization' (119964) panicked at src\blocks.rs:44:9:
assertion failed: !is_step_type("text")

---- blocks::tests::content_value_is_lenient stdout ----

thread 'blocks::tests::content_value_is_lenient' (106612) panicked at src\blocks.rs:57:9:
assertion `left == right` failed
  left: Object {}
 right: Object {"md": String("x")}

---- git::serialize::tests::non_step_blocks_serialize_and_get_no_md stdout ----

thread 'git::serialize::tests::non_step_blocks_serialize_and_get_no_md' (119408) panicked at src\git\serialize.rs:373:9:
assertion `left == right` failed
  left: ["steps/01-first.md", "steps/02-step.md", "steps/03-step.md", "steps/04-second.md"]
 right: ["steps/01-first.md", "steps/04-second.md"]

failures:
    blocks::tests::content_value_is_lenient
    blocks::tests::step_predicate_and_normalization
    git::serialize::tests::non_step_blocks_serialize_and_get_no_md

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.74s

*** result: Failure(101)
