*** src/blocks.rs:15:5: replace storage_type -> String with "xyzzy".into()

*** mutation diff:
--- src/blocks.rs
+++ replace storage_type -> String with "xyzzy".into()
@@ -7,17 +7,17 @@
 
 /// Шаг ли это (все прочие типы — блоки с type/content).
 pub fn is_step_type(t: &str) -> bool {
     t.is_empty() || t == "step"
 }
 
 /// type для ХРАНЕНИЯ (БД): шаг — всегда явный 'step', блок — как есть.
 pub fn storage_type(t: &str) -> String {
-    if is_step_type(t) { "step".to_string() } else { t.to_string() }
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 /// type для ПРОВОДА (proto): шаг — '', блок — как есть. None (NULL из БД) = шаг.
 pub fn wire_type(t: Option<&str>) -> String {
     match t {
         Some(t) if !is_step_type(t) => t.to_string(),
         _ => String::new(),
     }

---- blocks::tests::step_predicate_and_normalization stdout ----

thread 'blocks::tests::step_predicate_and_normalization' (62104) panicked at src\blocks.rs:45:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "step"

failures:
    blocks::tests::step_predicate_and_normalization

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.73s

*** result: Failure(101)
