*** src/blocks.rs:21:20: delete ! in wire_type

*** mutation diff:
--- src/blocks.rs
+++ delete ! in wire_type
@@ -13,17 +13,17 @@
 /// type для ХРАНЕНИЯ (БД): шаг — всегда явный 'step', блок — как есть.
 pub fn storage_type(t: &str) -> String {
     if is_step_type(t) { "step".to_string() } else { t.to_string() }
 }
 
 /// type для ПРОВОДА (proto): шаг — '', блок — как есть. None (NULL из БД) = шаг.
 pub fn wire_type(t: Option<&str>) -> String {
     match t {
-        Some(t) if !is_step_type(t) => t.to_string(),
+        Some(t) if  /* ~ changed by cargo-mutants ~ */is_step_type(t) => t.to_string(),
         _ => String::new(),
     }
 }
 
 /// content_json провода → jsonb payload: у шага и при пустом/битом JSON — {}
 /// (мягкость к клиентскому вводу, как в TS-адаптерах).
 pub fn content_value(step_type: &str, content_json: &str) -> serde_json::Value {
     if is_step_type(step_type) || content_json.is_empty() {

---- blocks::tests::step_predicate_and_normalization stdout ----

thread 'blocks::tests::step_predicate_and_normalization' (89828) panicked at src\blocks.rs:48:9:
assertion `left == right` failed
  left: "step"
 right: ""

failures:
    blocks::tests::step_predicate_and_normalization

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.18s

*** result: Failure(101)
