*** src/blocks.rs:29:5: replace content_value -> serde_json::Value with Default::default()

*** mutation diff:
--- src/blocks.rs
+++ replace content_value -> serde_json::Value with Default::default()
@@ -21,21 +21,17 @@
         Some(t) if !is_step_type(t) => t.to_string(),
         _ => String::new(),
     }
 }
 
 /// content_json провода → jsonb payload: у шага и при пустом/битом JSON — {}
 /// (мягкость к клиентскому вводу, как в TS-адаптерах).
 pub fn content_value(step_type: &str, content_json: &str) -> serde_json::Value {
-    if is_step_type(step_type) || content_json.is_empty() {
-        serde_json::json!({})
-    } else {
-        serde_json::from_str(content_json).unwrap_or_else(|_| serde_json::json!({}))
-    }
+    Default::default() /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]
     fn step_predicate_and_normalization() {

---- blocks::tests::content_value_is_lenient stdout ----

thread 'blocks::tests::content_value_is_lenient' (82804) panicked at src\blocks.rs:50:9:
assertion `left == right` failed
  left: Null
 right: Object {}

failures:
    blocks::tests::content_value_is_lenient

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 8.14s

*** result: Failure(101)
