*** src/git/project.rs:108:12: delete ! in read_step_files

*** mutation diff:
--- src/git/project.rs
+++ delete ! in read_step_files
@@ -100,17 +100,17 @@
         None => return out,
     };
     for e in steps_tree.iter() {
         // git2 0.21: name() → Result (не-UTF8 имя — ошибка, а не None).
         let name = match e.name() {
             Ok(n) => n,
             Err(_) => continue,
         };
-        if !name.ends_with(".md") {
+        if  /* ~ changed by cargo-mutants ~ */name.ends_with(".md") {
             continue;
         }
         // NN — цифры до первого '-' (или до '.md', если slug пуст).
         let digits: String = name.chars().take_while(|c| c.is_ascii_digit()).collect();
         let n: i32 = match digits.parse() {
             Ok(n) => n,
             Err(_) => continue,
         };

*** result: Success
