*** src/git/project.rs:138:5: replace front_value -> String with String::new()

*** mutation diff:
--- src/git/project.rs
+++ replace front_value -> String with String::new()
@@ -130,22 +130,17 @@
     pub title: Option<String>,
     pub desc: Option<String>,
     pub command: Option<String>,
 }
 
 /// Значение front-matter вида `key: <json-строка>` или `key: raw` → строка.
 /// version_files пишет title/section/command как JSON.stringify(...), level — сырьём.
 fn front_value(raw: &str) -> String {
-    let t = raw.trim();
-    if t.starts_with('"') {
-        serde_json::from_str::<String>(t).unwrap_or_else(|_| t.to_string())
-    } else {
-        t.to_string()
-    }
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 /// Обратный парс steps/NN-*.md → title/desc/command (зеркало bundle::step_file).
 /// Возвращает None для полей, которых нет в файле; вызывающий берёт их из list.json.
 /// Безопасное подмножество: subtasks/refs/why/section/level НЕ реэкспортируем
 /// (их источник — list.json), чтобы round-trip оставался идемпотентным.
 pub fn parse_step_md(content: &str) -> ParsedStepMd {
     let mut title = None;

---- git::project::tests::roundtrip_stable_without_desc_or_command stdout ----

thread 'git::project::tests::roundtrip_stable_without_desc_or_command' (96820) panicked at src\git\project.rs:464:9:
assertion `left == right` failed
  left: Some("")
 right: Some("Just a title")

---- git::project::tests::roundtrip_recovers_title_desc_command stdout ----

thread 'git::project::tests::roundtrip_recovers_title_desc_command' (61464) panicked at src\git\project.rs:453:9:
assertion `left == right` failed
  left: Some("")
 right: Some("Install Redis")

---- git::project::tests::modified_md_overrides_listjson stdout ----

thread 'git::project::tests::modified_md_overrides_listjson' (82052) panicked at src\git\project.rs:478:9:
assertion `left == right` failed
  left: Some("")
 right: Some("New title")

failures:
    git::project::tests::modified_md_overrides_listjson
    git::project::tests::roundtrip_recovers_title_desc_command
    git::project::tests::roundtrip_stable_without_desc_or_command

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.82s

*** result: Failure(101)
