*** src/git/project.rs:157:21: replace == with != in parse_step_md

*** mutation diff:
--- src/git/project.rs
+++ replace == with != in parse_step_md
@@ -149,17 +149,17 @@
 /// (их источник — list.json), чтобы round-trip оставался идемпотентным.
 pub fn parse_step_md(content: &str) -> ParsedStepMd {
     let mut title = None;
     let mut command = None;
 
     // 1) Front-matter между первой парой строк "---".
     let mut lines = content.lines();
     let mut body_start = 0usize; // индекс строки, с которой начинается тело
-    if lines.next() == Some("---") {
+    if lines.next() != /* ~ changed by cargo-mutants ~ */ Some("---") {
         let mut idx = 1usize;
         for line in content.lines().skip(1) {
             idx += 1;
             if line.trim_end() == "---" {
                 body_start = idx; // после закрывающего "---"
                 break;
             }
             if let Some(rest) = line.strip_prefix("title:") {

---- git::project::tests::modified_md_overrides_listjson stdout ----

thread 'git::project::tests::modified_md_overrides_listjson' (64144) panicked at src\git\project.rs:483:9:
assertion `left == right` failed
  left: None
 right: Some("New title")

---- git::project::tests::roundtrip_recovers_title_desc_command stdout ----

thread 'git::project::tests::roundtrip_recovers_title_desc_command' (78836) panicked at src\git\project.rs:458:9:
assertion `left == right` failed
  left: None
 right: Some("Install Redis")

---- git::project::tests::roundtrip_stable_without_desc_or_command stdout ----

thread 'git::project::tests::roundtrip_stable_without_desc_or_command' (118256) panicked at src\git\project.rs:469:9:
assertion `left == right` failed
  left: None
 right: Some("Just a title")

failures:
    git::project::tests::modified_md_overrides_listjson
    git::project::tests::roundtrip_recovers_title_desc_command
    git::project::tests::roundtrip_stable_without_desc_or_command

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.95s

*** result: Failure(101)
