*** src/git/project.rs:160:17: replace += with -= in parse_step_md

*** mutation diff:
--- src/git/project.rs
+++ replace += with -= in parse_step_md
@@ -152,17 +152,17 @@
     let mut command = None;
 
     // 1) Front-matter между первой парой строк "---".
     let mut lines = content.lines();
     let mut body_start = 0usize; // индекс строки, с которой начинается тело
     if lines.next() == Some("---") {
         let mut idx = 1usize;
         for line in content.lines().skip(1) {
-            idx += 1;
+            idx -= /* ~ changed by cargo-mutants ~ */ 1;
             if line.trim_end() == "---" {
                 body_start = idx; // после закрывающего "---"
                 break;
             }
             if let Some(rest) = line.strip_prefix("title:") {
                 title = Some(front_value(rest));
             } else if let Some(rest) = line.strip_prefix("command:") {
                 command = Some(front_value(rest));

---- git::project::tests::modified_md_overrides_listjson stdout ----

thread 'git::project::tests::modified_md_overrides_listjson' (81632) panicked at src\git\project.rs:160:13:
attempt to subtract with overflow

---- git::project::tests::roundtrip_recovers_title_desc_command stdout ----

thread 'git::project::tests::roundtrip_recovers_title_desc_command' (101648) panicked at src\git\project.rs:160:13:
attempt to subtract with overflow

---- git::project::tests::roundtrip_stable_without_desc_or_command stdout ----

thread 'git::project::tests::roundtrip_stable_without_desc_or_command' (69132) panicked at src\git\project.rs:160:13:
attempt to subtract with overflow

failures:
    git::project::tests::modified_md_overrides_listjson
    git::project::tests::roundtrip_recovers_title_desc_command
    git::project::tests::roundtrip_stable_without_desc_or_command

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.32s

*** result: Failure(101)
