*** src/git/project.rs:179:38: replace || with && in parse_step_md

*** mutation diff:
--- src/git/project.rs
+++ replace || with && in parse_step_md
@@ -171,17 +171,17 @@
     }
 
     // 2) Тело: desc — это текст ДО первого маркера (**Why:**, subtask "- [ ]", ref "- ").
     //    version_files кладёт desc первым блоком и отделяет пустой строкой.
     let body: Vec<&str> = content.lines().skip(body_start).collect();
     let mut desc_lines: Vec<&str> = Vec::new();
     for line in &body {
         let t = line.trim_start();
-        if t.starts_with("**Why:**") || t.starts_with("- [ ] ") || t.starts_with("- ") {
+        if t.starts_with("**Why:**") && /* ~ changed by cargo-mutants ~ */ t.starts_with("- [ ] ") || t.starts_with("- ") {
             break;
         }
         desc_lines.push(line);
     }
     // Обрезаем ведущие/замыкающие пустые строки (front-matter отделён пустой строкой).
     while desc_lines.first().map(|l| l.trim().is_empty()).unwrap_or(false) {
         desc_lines.remove(0);
     }

---- git::project::tests::roundtrip_stable_without_desc_or_command stdout ----

thread 'git::project::tests::roundtrip_stable_without_desc_or_command' (89524) panicked at src\git\project.rs:470:9:
assertion `left == right` failed
  left: Some("**Why:** always")
 right: None

---- git::project::tests::modified_md_overrides_listjson stdout ----

thread 'git::project::tests::modified_md_overrides_listjson' (68456) panicked at src\git\project.rs:484:9:
assertion `left == right` failed
  left: Some("new desc\n\n**Why:** always")
 right: Some("new desc")

---- git::project::tests::roundtrip_recovers_title_desc_command stdout ----

thread 'git::project::tests::roundtrip_recovers_title_desc_command' (81188) panicked at src\git\project.rs:459:9:
assertion `left == right` failed
  left: Some("Grab the binary\nand run it\n\n**Why:** always")
 right: Some("Grab the binary\nand run it")

failures:
    git::project::tests::modified_md_overrides_listjson
    git::project::tests::roundtrip_recovers_title_desc_command
    git::project::tests::roundtrip_stable_without_desc_or_command

test result: FAILED. 18 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.52s

*** result: Failure(101)
