*** src/git/project.rs:179:65: replace || with && in parse_step_md

*** mutation diff:
--- src/git/project.rs
+++ replace || with && in parse_step_md
@@ -171,17 +171,17 @@
     }
 
     // 2) Тело: desc — это текст ДО первого маркера (**Why:**, subtask "- [ ]", ref "- ").
     //    version_files кладёт desc первым блоком и отделяет пустой строкой.
     let body: Vec<&str> = content.lines().skip(body_start).collect();
     let mut desc_lines: Vec<&str> = Vec::new();
     for line in &body {
         let t = line.trim_start();
-        if t.starts_with("**Why:**") || t.starts_with("- [ ] ") || t.starts_with("- ") {
+        if t.starts_with("**Why:**") || t.starts_with("- [ ] ") && /* ~ changed by cargo-mutants ~ */ t.starts_with("- ") {
             break;
         }
         desc_lines.push(line);
     }
     // Обрезаем ведущие/замыкающие пустые строки (front-matter отделён пустой строкой).
     while desc_lines.first().map(|l| l.trim().is_empty()).unwrap_or(false) {
         desc_lines.remove(0);
     }

*** result: Success
