*** src/git/project.rs:198:5: replace tag_version -> Result<(), git2::Error> with Ok(())

*** mutation diff:
--- src/git/project.rs
+++ replace tag_version -> Result<(), git2::Error> with Ok(())
@@ -190,21 +190,17 @@
     }
     let desc = if desc_lines.is_empty() { None } else { Some(desc_lines.join("\n")) };
 
     ParsedStepMd { title, desc, command }
 }
 
 // Тег vN на запушенный tip (git2, force).
 fn tag_version(bare: &Path, ver: i32, tip_hex: &str) -> Result<(), git2::Error> {
-    let repo = git2::Repository::open_bare(bare)?;
-    let oid = git2::Oid::from_str(tip_hex)?;
-    let obj = repo.find_object(oid, Some(git2::ObjectType::Commit))?;
-    repo.tag_lightweight(&format!("v{ver}"), &obj, true)?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Срезает префикс "vN: " из subject коммита (порт /^v\d+:\s*/).
 fn strip_v_prefix(s: &str) -> String {
     let b = s.as_bytes();
     if b.first() == Some(&b'v') {
         let mut i = 1;
         while i < b.len() && b[i].is_ascii_digit() {

*** result: Success
