*** src/git/project.rs:207:5: replace strip_v_prefix -> String with "xyzzy".into()

*** mutation diff:
--- src/git/project.rs
+++ replace strip_v_prefix -> String with "xyzzy".into()
@@ -199,31 +199,17 @@
     let oid = git2::Oid::from_str(tip_hex)?;
     let obj = repo.find_object(oid, Some(git2::ObjectType::Commit))?;
     repo.tag_lightweight(&format!("v{ver}"), &obj, true)?;
     Ok(())
 }
 
 /// Срезает префикс "vN: " из subject коммита (порт /^v\d+:\s*/).
 fn strip_v_prefix(s: &str) -> String {
-    let b = s.as_bytes();
-    if b.first() == Some(&b'v') {
-        let mut i = 1;
-        while i < b.len() && b[i].is_ascii_digit() {
-            i += 1;
-        }
-        if i > 1 && i < b.len() && b[i] == b':' {
-            i += 1;
-            while i < b.len() && b[i] == b' ' {
-                i += 1;
-            }
-            return s[i..].to_string();
-        }
-    }
-    s.to_string()
+    "xyzzy".into() /* ~ changed by cargo-mutants ~ */
 }
 
 // Общий парс шагов: list.json (набор/порядок) + steps/NN-*.md (пер-шаговые оверрайды).
 fn parse_steps(steps_raw: &[RawStep], step_md: &HashMap<i32, String>) -> Vec<ProjStep> {
     // Шаг-блок без title — мусор; не-step блоки (text/image) валидны и без title.
     // orig_n — номер шага из list.json (совпадает с именем steps/NN-*.md для оверрайда).
     let mut kept: Vec<(i32, ProjStep)> = Vec::new();
     for (idx, s) in steps_raw.iter().enumerate() {

---- git::project::tests::strips_vn_prefix stdout ----

thread 'git::project::tests::strips_vn_prefix' (116048) panicked at src\git\project.rs:384:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "pushed via git"

failures:
    git::project::tests::strips_vn_prefix

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.07s

*** result: Failure(101)
