*** src/git/project.rs:208:18: replace == with != in strip_v_prefix

*** mutation diff:
--- src/git/project.rs
+++ replace == with != in strip_v_prefix
@@ -200,17 +200,17 @@
     let obj = repo.find_object(oid, Some(git2::ObjectType::Commit))?;
     repo.tag_lightweight(&format!("v{ver}"), &obj, true)?;
     Ok(())
 }
 
 /// Срезает префикс "vN: " из subject коммита (порт /^v\d+:\s*/).
 fn strip_v_prefix(s: &str) -> String {
     let b = s.as_bytes();
-    if b.first() == Some(&b'v') {
+    if b.first() != /* ~ changed by cargo-mutants ~ */ Some(&b'v') {
         let mut i = 1;
         while i < b.len() && b[i].is_ascii_digit() {
             i += 1;
         }
         if i > 1 && i < b.len() && b[i] == b':' {
             i += 1;
             while i < b.len() && b[i] == b' ' {
                 i += 1;

---- git::project::tests::strips_vn_prefix stdout ----

thread 'git::project::tests::strips_vn_prefix' (122836) panicked at src\git\project.rs:398:9:
assertion `left == right` failed
  left: "v12: pushed via git"
 right: "pushed via git"

failures:
    git::project::tests::strips_vn_prefix

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.54s

*** result: Failure(101)
