*** src/git/project.rs:211:15: replace += with *= in strip_v_prefix

*** mutation diff:
--- src/git/project.rs
+++ replace += with *= in strip_v_prefix
@@ -203,17 +203,17 @@
 }
 
 /// Срезает префикс "vN: " из subject коммита (порт /^v\d+:\s*/).
 fn strip_v_prefix(s: &str) -> String {
     let b = s.as_bytes();
     if b.first() == Some(&b'v') {
         let mut i = 1;
         while i < b.len() && b[i].is_ascii_digit() {
-            i += 1;
+            i *= /* ~ changed by cargo-mutants ~ */ 1;
         }
         if i > 1 && i < b.len() && b[i] == b':' {
             i += 1;
             while i < b.len() && b[i] == b' ' {
                 i += 1;
             }
             return s[i..].to_string();
         }

*** result: Timeout
