*** src/git/project.rs:215:31: replace && with || in strip_v_prefix

*** mutation diff:
--- src/git/project.rs
+++ replace && with || in strip_v_prefix
@@ -207,17 +207,17 @@
     let b = s.as_bytes();
     if b.first() == Some(&b'v') {
         let mut i = 1;
         while i < b.len() && b[i].is_ascii_digit() {
             i += 1;
         }
         if i > 1 && i < b.len() && b[i] == b':' {
             i += 1;
-            while i < b.len() && b[i] == b' ' {
+            while i < b.len() || /* ~ changed by cargo-mutants ~ */ b[i] == b' ' {
                 i += 1;
             }
             return s[i..].to_string();
         }
     }
     s.to_string()
 }

---- git::project::tests::strips_vn_prefix stdout ----

thread 'git::project::tests::strips_vn_prefix' (90616) panicked at src\git\project.rs:215:69:
index out of bounds: the len is 19 but the index is 19

failures:
    git::project::tests::strips_vn_prefix

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.20s

*** result: Failure(101)
