*** src/git/project.rs:254:37: delete ! in parse_steps

*** mutation diff:
--- src/git/project.rs
+++ delete ! in parse_steps
@@ -246,17 +246,17 @@
             why: s.why.clone().unwrap_or_default(),
             section: s.section.clone().unwrap_or_default(),
             subtasks: s.subtasks.clone().unwrap_or_default(),
             refs: s
                 .refs
                 .as_ref()
                 .map(|rs| {
                     rs.iter()
-                        .filter(|r| !r.label.as_deref().unwrap_or("").trim().is_empty())
+                        .filter(|r|  /* ~ changed by cargo-mutants ~ */r.label.as_deref().unwrap_or("").trim().is_empty())
                         .map(|r| ProjRef { label: r.label.clone().unwrap_or_default(), url: r.url.clone() })
                         .collect()
                 })
                 .unwrap_or_default(),
         };
         kept.push((s.n.unwrap_or((idx as i32) + 1), step));
     }

*** result: Success
