*** src/git/project.rs:260:47: replace + with - in parse_steps

*** mutation diff:
--- src/git/project.rs
+++ replace + with - in parse_steps
@@ -252,17 +252,17 @@
                 .map(|rs| {
                     rs.iter()
                         .filter(|r| !r.label.as_deref().unwrap_or("").trim().is_empty())
                         .map(|r| ProjRef { label: r.label.clone().unwrap_or_default(), url: r.url.clone() })
                         .collect()
                 })
                 .unwrap_or_default(),
         };
-        kept.push((s.n.unwrap_or((idx as i32) + 1), step));
+        kept.push((s.n.unwrap_or((idx as i32) - /* ~ changed by cargo-mutants ~ */ 1), step));
     }
 
     // list.json — источник истины для НАБОРА/порядка блоков; steps/NN-*.md — опциональные
     // пер-шаговые оверрайды контента (title/desc/command), только у шаг-блоков.
     // Ключ .md — номер шага из list.json (orig_n), а не позиция среди блоков.
     for (orig_n, step) in kept.iter_mut() {
         if !is_step_type(&step.block_type) {
             continue;

*** result: Success
