*** src/git/project.rs:267:12: delete ! in parse_steps

*** mutation diff:
--- src/git/project.rs
+++ delete ! in parse_steps
@@ -259,17 +259,17 @@
         };
         kept.push((s.n.unwrap_or((idx as i32) + 1), step));
     }
 
     // list.json — источник истины для НАБОРА/порядка блоков; steps/NN-*.md — опциональные
     // пер-шаговые оверрайды контента (title/desc/command), только у шаг-блоков.
     // Ключ .md — номер шага из list.json (orig_n), а не позиция среди блоков.
     for (orig_n, step) in kept.iter_mut() {
-        if !is_step_type(&step.block_type) {
+        if  /* ~ changed by cargo-mutants ~ */is_step_type(&step.block_type) {
             continue;
         }
         let Some(content) = step_md.get(orig_n) else { continue };
         let md = parse_step_md(content);
         if let Some(t) = md.title.filter(|t| !t.trim().is_empty() && *t != step.title) {
             step.title = t;
         }
         if let Some(d) = md.desc.filter(|d| *d != step.desc) {

*** result: Success
