*** src/git/project.rs:272:67: replace && with || in parse_steps

*** mutation diff:
--- src/git/project.rs
+++ replace && with || in parse_steps
@@ -264,17 +264,17 @@
     // пер-шаговые оверрайды контента (title/desc/command), только у шаг-блоков.
     // Ключ .md — номер шага из list.json (orig_n), а не позиция среди блоков.
     for (orig_n, step) in kept.iter_mut() {
         if !is_step_type(&step.block_type) {
             continue;
         }
         let Some(content) = step_md.get(orig_n) else { continue };
         let md = parse_step_md(content);
-        if let Some(t) = md.title.filter(|t| !t.trim().is_empty() && *t != step.title) {
+        if let Some(t) = md.title.filter(|t| !t.trim().is_empty() || /* ~ changed by cargo-mutants ~ */ *t != step.title) {
             step.title = t;
         }
         if let Some(d) = md.desc.filter(|d| *d != step.desc) {
             step.desc = d;
         }
         if let Some(c) = md.command.filter(|c| *c != step.command) {
             step.command = c;
         }

*** result: Success
