*** src/git/project.rs:275:48: replace != with == in parse_steps

*** mutation diff:
--- src/git/project.rs
+++ replace != with == in parse_steps
@@ -267,17 +267,17 @@
         if !is_step_type(&step.block_type) {
             continue;
         }
         let Some(content) = step_md.get(orig_n) else { continue };
         let md = parse_step_md(content);
         if let Some(t) = md.title.filter(|t| !t.trim().is_empty() && *t != step.title) {
             step.title = t;
         }
-        if let Some(d) = md.desc.filter(|d| *d != step.desc) {
+        if let Some(d) = md.desc.filter(|d| *d == /* ~ changed by cargo-mutants ~ */ step.desc) {
             step.desc = d;
         }
         if let Some(c) = md.command.filter(|c| *c != step.command) {
             step.command = c;
         }
     }
 
     kept.into_iter().map(|(_, s)| s).collect()

*** result: Success
