*** src/git/project.rs:278:51: replace != with == in parse_steps

*** mutation diff:
--- src/git/project.rs
+++ replace != with == in parse_steps
@@ -270,17 +270,17 @@
         let Some(content) = step_md.get(orig_n) else { continue };
         let md = parse_step_md(content);
         if let Some(t) = md.title.filter(|t| !t.trim().is_empty() && *t != step.title) {
             step.title = t;
         }
         if let Some(d) = md.desc.filter(|d| *d != step.desc) {
             step.desc = d;
         }
-        if let Some(c) = md.command.filter(|c| *c != step.command) {
+        if let Some(c) = md.command.filter(|c| *c == /* ~ changed by cargo-mutants ~ */ step.command) {
             step.command = c;
         }
     }
 
     kept.into_iter().map(|(_, s)| s).collect()
 }
 
 /// Снапшот произвольного ref (ветки): мета list.json + шаги. Для read-only рендера.

*** result: Success
