*** src/git/project.rs:304:5: replace commit_snapshot -> Option<BranchSnapshotData> with None

*** mutation diff:
--- src/git/project.rs
+++ replace commit_snapshot -> Option<BranchSnapshotData> with None
@@ -296,20 +296,17 @@
 /// Снапшот ветки по refname: мета list.json + шаги с tip'а. Для read-only рендера.
 pub fn branch_snapshot(bare: &Path, refname: &str) -> Option<BranchSnapshotData> {
     let (tip, raw, _subject, step_md) = read_ref_tip(bare, refname)?;
     snapshot_from_data(tip, &raw, &step_md)
 }
 
 /// Материализация произвольного коммита (merge-base для трёхстороннего merge).
 pub fn commit_snapshot(bare: &Path, sha: &str) -> Option<BranchSnapshotData> {
-    let repo = git2::Repository::open_bare(bare).ok()?;
-    let oid = git2::Oid::from_str(sha).ok()?;
-    let (tip, raw, _subject, step_md) = read_commit_data(&repo, oid)?;
-    snapshot_from_data(tip, &raw, &step_md)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 fn snapshot_from_data(tip: String, raw: &[u8], step_md: &HashMap<i32, String>) -> Option<BranchSnapshotData> {
     let parsed: RawList = serde_json::from_slice(raw).ok()?;
     let steps = parse_steps(parsed.steps.as_deref().unwrap_or(&[]), step_md);
     Some(BranchSnapshotData {
         tip,
         title: parsed.title.unwrap_or_default(),

*** result: Success
