*** src/git/project.rs:311:5: replace snapshot_from_data -> Option<BranchSnapshotData> with None

*** mutation diff:
--- src/git/project.rs
+++ replace snapshot_from_data -> Option<BranchSnapshotData> with None
@@ -303,26 +303,17 @@
 pub fn commit_snapshot(bare: &Path, sha: &str) -> Option<BranchSnapshotData> {
     let repo = git2::Repository::open_bare(bare).ok()?;
     let oid = git2::Oid::from_str(sha).ok()?;
     let (tip, raw, _subject, step_md) = read_commit_data(&repo, oid)?;
     snapshot_from_data(tip, &raw, &step_md)
 }
 
 fn snapshot_from_data(tip: String, raw: &[u8], step_md: &HashMap<i32, String>) -> Option<BranchSnapshotData> {
-    let parsed: RawList = serde_json::from_slice(raw).ok()?;
-    let steps = parse_steps(parsed.steps.as_deref().unwrap_or(&[]), step_md);
-    Some(BranchSnapshotData {
-        tip,
-        title: parsed.title.unwrap_or_default(),
-        desc: parsed.desc.unwrap_or_default(),
-        tags: parsed.tags.unwrap_or_default(),
-        ordered: parsed.ordered.unwrap_or(true),
-        steps,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Проецирует запушенный tip main → новая версия списка (порт project.ts projectPushedCommit).
 /// Источник контента — list.json в корне дерева.
 ///
 /// Семантика результата (важно для вызывающих):
 /// - `Ok(Some(v))` — создана версия v;
 /// - `Ok(None)` — проецировать нечего (нет валидного list.json/steps) — НЕ ошибка;

*** result: Success
