*** src/git/project.rs:339:5: replace project_pushed_commit -> Result<Option<i32>, sqlx::Error> with Ok(Some(1))

*** mutation diff:
--- src/git/project.rs
+++ replace project_pushed_commit -> Result<Option<i32>, sqlx::Error> with Ok(Some(1))
@@ -331,66 +331,17 @@
 ///   (CLI-режим в main.rs).
 pub async fn project_pushed_commit(
     pool: &PgPool,
     template_id: Uuid,
     bare: &Path,
 ) -> Result<Option<i32>, sqlx::Error> {
     // git2-объекты не Send и блокируют поток → всё git-чтение в spawn_blocking,
     // наружу только owned-данные.
-    let bare_read = bare.to_path_buf();
-    let Some((tip, raw, subject, step_md)) =
-        tokio::task::spawn_blocking(move || read_tip(&bare_read)).await.map_err(join_err)?
-    else {
-        return Ok(None);
-    };
-    let parsed: RawList = match serde_json::from_slice(&raw) {
-        Ok(p) => p,
-        Err(e) => {
-            // Пользовательский вход: битый list.json — не сбой сервиса, но след оставляем.
-            tracing::warn!(%template_id, error = %e, "проекция: list.json не парсится — версия не создана");
-            return Ok(None);
-        }
-    };
-    let Some(steps_raw) = parsed.steps.as_ref() else {
-        return Ok(None);
-    };
-
-    let note: String = {
-        let stripped: String = strip_v_prefix(&subject).chars().take(200).collect();
-        if stripped.trim().is_empty() { "pushed via git".to_string() } else { stripped }
-    };
-
-    let steps = parse_steps(steps_raw, &step_md);
-
-    let ver = db::add_version(pool, template_id, &note, &steps).await?;
-    // Мета и тег — вторичны: их сбой не отменяет созданную версию, но виден в логе.
-    if let Err(e) = db::update_meta(
-        pool,
-        template_id,
-        parsed.title.clone(),
-        parsed.desc.clone(),
-        parsed.tags.clone(),
-        parsed.ordered,
-    )
-    .await
-    {
-        tracing::error!(%template_id, ver, error = %e, "проекция: версия создана, но мета не обновлена");
-    }
-    // Тег vN на запушенный коммит (для maxTagVersion/истории). Без тега ensure_repo
-    // может повторно досыпать версию поверх (шум истории, не потеря данных).
-    let bare_tag = bare.to_path_buf();
-    match tokio::task::spawn_blocking(move || tag_version(&bare_tag, ver, &tip)).await {
-        Ok(Ok(())) => {}
-        Ok(Err(e)) => tracing::error!(%template_id, ver, error = %e, "проекция: тег не поставлен"),
-        Err(e) => {
-            tracing::error!(%template_id, ver, error = %e, "проекция: тег не поставлен (задача прервана)")
-        }
-    }
-    Ok(Some(ver))
+    Ok(Some(1)) /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::{ParsedStepMd, parse_step_md, strip_v_prefix};
     use crate::git::bundle::{SerStep, StepRef};
 
     #[test]

*** result: Success
