*** src/git/project.rs:74:5: replace read_ref_tip -> Option<TipData> with None

*** mutation diff:
--- src/git/project.rs
+++ replace read_ref_tip -> Option<TipData> with None
@@ -66,19 +66,17 @@
 type TipData = (String, Vec<u8>, String, HashMap<i32, String>);
 
 fn read_tip(bare: &Path) -> Option<TipData> {
     read_ref_tip(bare, MAIN_REF)
 }
 
 /// То же для произвольного ref (ветки) — база просмотра списка «на ветке».
 pub fn read_ref_tip(bare: &Path, refname: &str) -> Option<TipData> {
-    let repo = git2::Repository::open_bare(bare).ok()?;
-    let tip = repo.refname_to_id(refname).ok()?;
-    read_commit_data(&repo, tip)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 // Общее чтение материализации из конкретного коммита (ref-tip или merge-base).
 fn read_commit_data(repo: &git2::Repository, oid: git2::Oid) -> Option<TipData> {
     let commit = repo.find_commit(oid).ok()?;
     let tree = commit.tree().ok()?;
     let entry = tree.get_path(Path::new("list.json")).ok()?;
     let blob = entry.to_object(repo).ok()?;

*** result: Success
