*** src/git/project.rs:94:5: replace read_step_files -> HashMap<i32, String> with HashMap::from_iter([(-1, "xyzzy".into())])

*** mutation diff:
--- src/git/project.rs
+++ replace read_step_files -> HashMap<i32, String> with HashMap::from_iter([(-1, "xyzzy".into())])
@@ -86,46 +86,17 @@
     let subject = commit.summary().ok().flatten().unwrap_or("").to_string();
     let steps = read_step_files(repo, &tree);
     Some((oid.to_string(), raw, subject, steps))
 }
 
 // Собирает steps/NN-*.md из дерева: ключ — префикс NN (число до первого '-'), значение — контент.
 // Индекс парсим из имени файла (как его пишет version_files через pad(n, width)).
 fn read_step_files(repo: &git2::Repository, tree: &git2::Tree) -> HashMap<i32, String> {
-    let mut out = HashMap::new();
-    let steps_tree = match tree.get_path(Path::new("steps")).ok().and_then(|e| e.to_object(repo).ok()) {
-        Some(obj) => match obj.into_tree() {
-            Ok(t) => t,
-            Err(_) => return out,
-        },
-        None => return out,
-    };
-    for e in steps_tree.iter() {
-        // git2 0.21: name() → Result (не-UTF8 имя — ошибка, а не None).
-        let name = match e.name() {
-            Ok(n) => n,
-            Err(_) => continue,
-        };
-        if !name.ends_with(".md") {
-            continue;
-        }
-        // NN — цифры до первого '-' (или до '.md', если slug пуст).
-        let digits: String = name.chars().take_while(|c| c.is_ascii_digit()).collect();
-        let n: i32 = match digits.parse() {
-            Ok(n) => n,
-            Err(_) => continue,
-        };
-        if let Some(blob) = e.to_object(repo).ok().and_then(|o| o.into_blob().ok())
-            && let Ok(s) = String::from_utf8(blob.content().to_vec())
-        {
-            out.insert(n, s);
-        }
-    }
-    out
+    HashMap::from_iter([(-1, "xyzzy".into())]) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Разобранный per-step .md — безопасное подмножество полей (title/desc/command),
 /// которое можно однозначно распарсить обратно из формата bundle::step_file.
 #[derive(Debug, PartialEq)]
 pub struct ParsedStepMd {
     pub title: Option<String>,
     pub desc: Option<String>,

*** result: Success
