*** src/ratelimit.rs:102:64: replace > with < in RateLimited<S>::allow

*** mutation diff:
--- src/ratelimit.rs
+++ replace > with < in RateLimited<S>::allow
@@ -94,17 +94,17 @@
         if limit == 0 {
             return true;
         }
         let now = Instant::now();
         // Отравление мьютекса (паника держателя) не должно ронять весь трафик:
         // окна внутри валидны как данные — забираем их как есть.
         let mut windows = self.state.windows.lock().unwrap_or_else(|p| p.into_inner());
         let q = windows.entry(method.to_string()).or_default();
-        while q.front().is_some_and(|t| now.duration_since(*t) > WINDOW) {
+        while q.front().is_some_and(|t| now.duration_since(*t) < /* ~ changed by cargo-mutants ~ */ WINDOW) {
             q.pop_front();
         }
         if q.len() as u32 >= limit {
             metrics::counter!("rpc_rate_limited_total", "method" => method.to_string()).increment(1);
             return false;
         }
         q.push_back(now);
         true

---- ratelimit::tests::allows_under_limit_blocks_over stdout ----

thread 'ratelimit::tests::allows_under_limit_blocks_over' (120668) panicked at src\ratelimit.rs:165:9:
третий запрос сверх rpm=2 в одном окне

---- ratelimit::tests::health_and_reflection_bypass stdout ----

thread 'ratelimit::tests::health_and_reflection_bypass' (118528) panicked at src\ratelimit.rs:189:9:
assertion failed: !rl.allow(M, None)

---- ratelimit::tests::heavy_has_separate_budget stdout ----

thread 'ratelimit::tests::heavy_has_separate_budget' (79100) panicked at src\ratelimit.rs:172:9:
второй тяжёлый сверх heavy=1

failures:
    ratelimit::tests::allows_under_limit_blocks_over
    ratelimit::tests::health_and_reflection_bypass
    ratelimit::tests::heavy_has_separate_budget
    ratelimit::tests::unauthorized_do_not_consume_window

test result: FAILED. 17 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.43s

*** result: Failure(101)
