*** src/ratelimit.rs:102:64: replace > with >= in RateLimited<S>::allow

*** mutation diff:
--- src/ratelimit.rs
+++ replace > with >= in RateLimited<S>::allow
@@ -94,17 +94,17 @@
         if limit == 0 {
             return true;
         }
         let now = Instant::now();
         // Отравление мьютекса (паника держателя) не должно ронять весь трафик:
         // окна внутри валидны как данные — забираем их как есть.
         let mut windows = self.state.windows.lock().unwrap_or_else(|p| p.into_inner());
         let q = windows.entry(method.to_string()).or_default();
-        while q.front().is_some_and(|t| now.duration_since(*t) > WINDOW) {
+        while q.front().is_some_and(|t| now.duration_since(*t) >= /* ~ changed by cargo-mutants ~ */ WINDOW) {
             q.pop_front();
         }
         if q.len() as u32 >= limit {
             metrics::counter!("rpc_rate_limited_total", "method" => method.to_string()).increment(1);
             return false;
         }
         q.push_back(now);
         true

*** result: Success
