*** src/ratelimit.rs:127:9: replace <impl Service<Request<ReqBody>> for RateLimited<S>>::poll_ready -> Poll<Result<(), Self::Error>> with Poll::from(Ok(()))

*** mutation diff:
--- src/ratelimit.rs
+++ replace <impl Service<Request<ReqBody>> for RateLimited<S>>::poll_ready -> Poll<Result<(), Self::Error>> with Poll::from(Ok(()))
@@ -119,17 +119,17 @@
     type Response = S::Response;
     type Error = S::Error;
     type Future = futures_util::future::Either<
         S::Future,
         futures_util::future::Ready<Result<Self::Response, Self::Error>>,
     >;
 
     fn poll_ready(&mut self, cx: &mut Context<'_>) -> Poll<Result<(), Self::Error>> {
-        self.inner.poll_ready(cx)
+        Poll::from(Ok(())) /* ~ changed by cargo-mutants ~ */
     }
 
     fn call(&mut self, req: Request<ReqBody>) -> Self::Future {
         let auth = req.headers().get("authorization").and_then(|v| v.to_str().ok()).map(str::to_owned);
         if self.allow(req.uri().path(), auth.as_deref()) {
             futures_util::future::Either::Left(self.inner.call(req))
         } else {
             // gRPC-отказ без вызова inner: RESOURCE_EXHAUSTED в trailers-only ответе.

*** result: Success
