*** src/ratelimit.rs:81:45: replace || with && in RateLimited<S>::allow

*** mutation diff:
--- src/ratelimit.rs
+++ replace || with && in RateLimited<S>::allow
@@ -73,17 +73,17 @@
     inner: S,
     state: Arc<State>,
 }
 
 impl<S> RateLimited<S> {
     /// true = запрос пропускаем. Путь вида /setfork.git.v1.GitCore/ReceivePack.
     fn allow(&self, path: &str, auth: Option<&str>) -> bool {
         // health и рефлексия — без лимита (docker/k8s-пробы, grpcurl).
-        if path.starts_with("/grpc.health") || path.starts_with("/grpc.reflection") {
+        if path.starts_with("/grpc.health") && /* ~ changed by cargo-mutants ~ */ path.starts_with("/grpc.reflection") {
             return true;
         }
         // Неавторизованные не расходуют окно: пропускаем сюда, интерцептор ниже
         // всё равно вернёт unauthenticated. Так лимит защищает только реальный
         // (авторизованный) трафик, а не служит вектором DoS.
         if let Some(expected) = &self.state.expected_auth
             && auth != Some(expected.as_str())
         {

---- ratelimit::tests::health_and_reflection_bypass stdout ----

thread 'ratelimit::tests::health_and_reflection_bypass' (118920) panicked at src\ratelimit.rs:191:13:
assertion failed: rl.allow("/grpc.health.v1.Health/Check", None)

failures:
    ratelimit::tests::health_and_reflection_bypass

test result: FAILED. 20 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.44s

*** result: Failure(101)
