*** src/ratelimit.rs:94:18: replace == with != in RateLimited<S>::allow

*** mutation diff:
--- src/ratelimit.rs
+++ replace == with != in RateLimited<S>::allow
@@ -86,17 +86,17 @@
         // (авторизованный) трафик, а не служит вектором DoS.
         if let Some(expected) = &self.state.expected_auth
             && auth != Some(expected.as_str())
         {
             return true;
         }
         let method = path.rsplit('/').next().unwrap_or(path);
         let limit = if HEAVY.contains(&method) { self.state.rpm_heavy } else { self.state.rpm };
-        if limit == 0 {
+        if limit != /* ~ changed by cargo-mutants ~ */ 0 {
             return true;
         }
         let now = Instant::now();
         // Отравление мьютекса (паника держателя) не должно ронять весь трафик:
         // окна внутри валидны как данные — забираем их как есть.
         let mut windows = self.state.windows.lock().unwrap_or_else(|p| p.into_inner());
         let q = windows.entry(method.to_string()).or_default();
         while q.front().is_some_and(|t| now.duration_since(*t) > WINDOW) {

---- ratelimit::tests::health_and_reflection_bypass stdout ----

thread 'ratelimit::tests::health_and_reflection_bypass' (80412) panicked at src\ratelimit.rs:189:9:
assertion failed: !rl.allow(M, None)

---- ratelimit::tests::allows_under_limit_blocks_over stdout ----

thread 'ratelimit::tests::allows_under_limit_blocks_over' (72196) panicked at src\ratelimit.rs:165:9:
третий запрос сверх rpm=2 в одном окне

---- ratelimit::tests::heavy_has_separate_budget stdout ----

thread 'ratelimit::tests::heavy_has_separate_budget' (70892) panicked at src\ratelimit.rs:172:9:
второй тяжёлый сверх heavy=1

failures:
    ratelimit::tests::allows_under_limit_blocks_over
    ratelimit::tests::health_and_reflection_bypass
    ratelimit::tests::heavy_has_separate_budget
    ratelimit::tests::unauthorized_do_not_consume_window
    ratelimit::tests::zero_limit_disables

test result: FAILED. 16 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 7.40s

*** result: Failure(101)
